system/dpd/src/lib/API/Client/logs/a683a73b4eaa93401ce6772af239726b.logs

LOCATION: 
http://wstest.dpd.ru/services/calculator2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/calculator/2012-03-20"><SOAP-ENV:Body><ns1:getServiceCost2><request><auth><clientNumber>1001012185</clientNumber><clientKey>F75BDF1EEA3589CAF82D01DD75D6AFCB3F9797DA</clientKey></auth><pickup><cityId>49694102</cityId><cityName>Москва</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></pickup><delivery><cityId>49080222</cityId><cityName>Ярославль</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></delivery><selfPickup>false</selfPickup><selfDelivery>true</selfDelivery><weight>3.5</weight><declaredValue>0</declaredValue></request></ns1:getServiceCost2></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:getServiceCost2Response xmlns:ns2="http://dpd.ru/ws/calculator/2012-03-20"><return><serviceCode>MAX</serviceCode><serviceName>DPD MAX domestic</serviceName><cost>1026.0</cost><days>2</days></return><return><serviceCode>NDY</serviceCode><serviceName>DPD EXPRESS</serviceName><cost>1496.1</cost><days>1</days></return><return><serviceCode>BZP</serviceCode><serviceName>DPD 18:00</serviceName><cost>909.66</cost><days>1</days></return><return><serviceCode>CUR</serviceCode><serviceName>DPD CLASSIC</serviceName><cost>988.62</cost><days>1</days></return><return><serviceCode>ECN</serviceCode><serviceName>DPD ECONOMY</serviceName><cost>709.74</cost><days>2</days></return><return><serviceCode>CSM</serviceCode><serviceName>DPD Online Express</serviceName><cost>312.0</cost><days>1</days></return><return><serviceCode>PCL</serviceCode><serviceName>DPD OPTIMUM</serviceName><cost>390.0</cost><days>1</days></return><return><serviceCode>MXO</serviceCode><serviceName>DPD Standard</serviceName><cost>276.0</cost><days>2</days></return><return><serviceCode>IND</serviceCode><serviceName>DPD EXPRESS 13:00</serviceName><cost>1940.66</cost><days>1</days></return></ns2:getServiceCost2Response></S:Body></S:Envelope>
