system/dpd/src/lib/API/Client/logs/43b3d53fe765e0a61dd8c2172cbea1ce.logs

LOCATION: 
http://wstest.dpd.ru:80/services/calculator2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/calculator/2012-03-20"><SOAP-ENV:Body><ns1:getServiceCost2><request><auth><clientNumber>1001012185</clientNumber><clientKey>F75BDF1EEA3589CAF82D01DD75D6AFCB3F9797DA</clientKey></auth><pickup><cityId>49694102</cityId><cityName>Москва</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></pickup><delivery><cityId>49694102</cityId><cityName>Москва</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></delivery><selfPickup>false</selfPickup><selfDelivery>true</selfDelivery><weight>1</weight><volume>0.002</volume><declaredValue>0</declaredValue></request></ns1:getServiceCost2></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:getServiceCost2Response xmlns:ns2="http://dpd.ru/ws/calculator/2012-03-20"><return><serviceCode>MAX</serviceCode><serviceName>DPD MAX domestic</serviceName><cost>894.0</cost><days>2</days></return><return><serviceCode>NDY</serviceCode><serviceName>DPD EXPRESS</serviceName><cost>865.62</cost><days>1</days></return><return><serviceCode>BZP</serviceCode><serviceName>DPD 18:00</serviceName><cost>1792.91</cost><days>1</days></return><return><serviceCode>CUR</serviceCode><serviceName>DPD CLASSIC</serviceName><cost>439.68</cost><days>1</days></return><return><serviceCode>ECN</serviceCode><serviceName>DPD ECONOMY</serviceName><cost>568.96</cost><days>1</days></return><return><serviceCode>CSM</serviceCode><serviceName>DPD Online Express</serviceName><cost>216.0</cost><days>1</days></return><return><serviceCode>PCL</serviceCode><serviceName>DPD OPTIMUM</serviceName><cost>282.0</cost><days>1</days></return><return><serviceCode>MXO</serviceCode><serviceName>DPD Online Max</serviceName><cost>840.0</cost><days>1</days></return><return><serviceCode>IND</serviceCode><serviceName>DPD EXPRESS 13:00</serviceName><cost>1038.74</cost><days>1</days></return></ns2:getServiceCost2Response></S:Body></S:Envelope>
