system/dpd/src/lib/API/Client/logs/b86243ecd843c71c74defd8c3de48dbf.logs

LOCATION: 
https://wstest.dpd.ru/services/calculator2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/calculator/2012-03-20"><SOAP-ENV:Body><ns1:getServiceCost2><request><auth><clientNumber>1001027795</clientNumber><clientKey>182A17BD6FC5557D1FCA30FA1D56593EB21AEF88</clientKey></auth><pickup><cityId>49694102</cityId><cityName>Москва</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></pickup><delivery><cityId>196017762</cityId><cityName>Пятигорск</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></delivery><selfPickup>false</selfPickup><selfDelivery>true</selfDelivery><weight>1</weight><volume>0.00054</volume><declaredValue>0</declaredValue></request></ns1:getServiceCost2></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:getServiceCost2Response xmlns:ns2="http://dpd.ru/ws/calculator/2012-03-20"><return><serviceCode>MAX</serviceCode><serviceName>DPD MAX domestic</serviceName><cost>1014.0</cost><days>4</days></return><return><serviceCode>NDY</serviceCode><serviceName>DPD EXPRESS</serviceName><cost>2003.57</cost><days>2</days></return><return><serviceCode>BZP</serviceCode><serviceName>DPD 18:00</serviceName><cost>706.88</cost><days>2</days></return><return><serviceCode>CUR</serviceCode><serviceName>DPD CLASSIC</serviceName><cost>1378.67</cost><days>2</days></return><return><serviceCode>ECN</serviceCode><serviceName>DPD ECONOMY</serviceName><cost>556.94</cost><days>3</days></return><return><serviceCode>CSM</serviceCode><serviceName>DPD Online Express</serviceName><cost>352.8</cost><days>2</days></return><return><serviceCode>PCL</serviceCode><serviceName>DPD OPTIMUM</serviceName><cost>338.4</cost><days>2</days></return><return><serviceCode>MXO</serviceCode><serviceName>DPD Standard</serviceName><cost>314.4</cost><days>3</days></return><return><serviceCode>IND</serviceCode><serviceName>DPD EXPRESS 13:00</serviceName><cost>2597.72</cost><days>2</days></return></ns2:getServiceCost2Response></S:Body></S:Envelope>
